{"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "image_input1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "image_input1"}, "inbound_nodes": []}, {"name": "image_input2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "image_input2"}, "inbound_nodes": []}, {"name": "image_input3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 1], "dtype": "float32", "sparse": false, "name": "image_input3"}, "inbound_nodes": []}, {"name": "image_input4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 1], "dtype": "float32", "sparse": false, "name": "image_input4"}, "inbound_nodes": []}, {"name": "model_11", "class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "encoded", "class_name": "MaxPooling2D", "config": {"name": "encoded", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoded", 0, 0, {}]]]}, {"name": "up_sampling2d_13", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_13", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_13", 0, 0, {}]]]}, {"name": "up_sampling2d_14", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_14", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_14", 0, 0, {}]]]}, {"name": "up_sampling2d_15", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_15", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "decoded", "class_name": "Conv2D", "config": {"name": "decoded", "trainable": true, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_15", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["decoded", 0, 0]]}, "inbound_nodes": [[["image_input1", 0, 0, {}]]]}, {"name": "model_13", "class_name": "Model", "config": {"name": "model_13", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "max_pooling2d_11", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_11", 0, 0, {}]]]}, {"name": "encoded", "class_name": "MaxPooling2D", "config": {"name": "encoded", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoded", 0, 0, {}]]]}, {"name": "up_sampling2d_18", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_18", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_18", 0, 0, {}]]]}, {"name": "up_sampling2d_19", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_19", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "decoded", "class_name": "Conv2D", "config": {"name": "decoded", "trainable": true, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_19", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["decoded", 0, 0]]}, "inbound_nodes": [[["image_input2", 0, 0, {}]]]}, {"name": "model_14", "class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv2d_39", "class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "max_pooling2d_12", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"name": "conv2d_40", "class_name": "Conv2D", "config": {"name": "conv2d_40", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"name": "encoded", "class_name": "MaxPooling2D", "config": {"name": "encoded", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_40", 0, 0, {}]]]}, {"name": "conv2d_41", "class_name": "Conv2D", "config": {"name": "conv2d_41", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoded", 0, 0, {}]]]}, {"name": "up_sampling2d_20", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_20", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_41", 0, 0, {}]]]}, {"name": "conv2d_42", "class_name": "Conv2D", "config": {"name": "conv2d_42", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_20", 0, 0, {}]]]}, {"name": "up_sampling2d_21", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_21", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_42", 0, 0, {}]]]}, {"name": "decoded", "class_name": "Conv2D", "config": {"name": "decoded", "trainable": true, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_21", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["decoded", 0, 0]]}, "inbound_nodes": [[["image_input3", 0, 0, {}]]]}, {"name": "model_16", "class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 1], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "max_pooling2d_14", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"name": "conv2d_48", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "encoded", "class_name": "MaxPooling2D", "config": {"name": "encoded", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}, {"name": "conv2d_49", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoded", 0, 0, {}]]]}, {"name": "up_sampling2d_24", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_24", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"name": "conv2d_50", "class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_24", 0, 0, {}]]]}, {"name": "up_sampling2d_25", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_25", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"name": "decoded", "class_name": "Conv2D", "config": {"name": "decoded", "trainable": true, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_25", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["decoded", 0, 0]]}, "inbound_nodes": [[["image_input4", 0, 0, {}]]]}, {"name": "flat1", "class_name": "Flatten", "config": {"name": "flat1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["model_11", 1, 0, {}]]]}, {"name": "flat2", "class_name": "Flatten", "config": {"name": "flat2", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["model_13", 1, 0, {}]]]}, {"name": "flat3", "class_name": "Flatten", "config": {"name": "flat3", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["model_14", 1, 0, {}]]]}, {"name": "flat4", "class_name": "Flatten", "config": {"name": "flat4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["model_16", 1, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["flat1", 0, 0, {}], ["flat2", 0, 0, {}], ["flat3", 0, 0, {}], ["flat4", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"name": "output_layer", "class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_17", 0, 0, {}]]]}], "input_layers": [["image_input1", 0, 0], ["image_input2", 0, 0], ["image_input3", 0, 0], ["image_input4", 0, 0]], "output_layers": [["output_layer", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}